tripleProduct(XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
The triple product of of three vectors vec0, vec1, vec2 is defined as
dot(cross(vec0, vec1), vec2).
It is equal to the signed volume of the parallelepiped spanned by the three vectors.
It is zero if and only if the vectors are linearly dependent. This function is equivalent
to the Vec3d function vecVolume.